:PROPERTIES:
:ID:       381fb30d-4bdf-4d08-b8d1-6ddeae462a43
:header-args:python: :results output
:END:
#+title: tensorflow-example-minist2
#+date: [2024-05-13 一]
#+last_modified: [2024-05-13 一 22:42]




* 训练模型

#+begin_src python :session mnist
from tensorflow.keras.datasets import mnist
(train_images, train_labels), (test_images, test_labels) = mnist.load_data(path="/home/lyt0628/download/mnist.npz")

train_images = train_images.reshape((60000, 28 * 28))
train_images = train_images.astype("float32") / 255
test_images = test_images.reshape((10000, 28 * 28))
test_images = test_images.astype("float32") / 255

fit(model, train_images, train_labels, epochs=10, batch_size=128)
#+end_src

#+RESULTS:
#+begin_example
Epoch 0
loss at batch 0: 4.47
loss at batch 100: 2.23
loss at batch 200: 2.22
loss at batch 300: 2.06
loss at batch 400: 2.18
Epoch 1
loss at batch 0: 1.89
loss at batch 100: 1.87
loss at batch 200: 1.84
loss at batch 300: 1.69
loss at batch 400: 1.79
Epoch 2
loss at batch 0: 1.58
loss at batch 100: 1.58
loss at batch 200: 1.51
loss at batch 300: 1.42
loss at batch 400: 1.48
Epoch 3
loss at batch 0: 1.33
loss at batch 100: 1.34
loss at batch 200: 1.25
loss at batch 300: 1.20
loss at batch 400: 1.26
Epoch 4
loss at batch 0: 1.13
loss at batch 100: 1.16
loss at batch 200: 1.06
loss at batch 300: 1.04
loss at batch 400: 1.10
Epoch 5
loss at batch 0: 0.99
loss at batch 100: 1.02
loss at batch 200: 0.92
loss at batch 300: 0.92
loss at batch 400: 0.98
Epoch 6
loss at batch 0: 0.88
loss at batch 100: 0.91
loss at batch 200: 0.81
loss at batch 300: 0.83
loss at batch 400: 0.90
Epoch 7
loss at batch 0: 0.79
loss at batch 100: 0.83
loss at batch 200: 0.73
loss at batch 300: 0.76
loss at batch 400: 0.83
Epoch 8
loss at batch 0: 0.73
loss at batch 100: 0.76
loss at batch 200: 0.67
loss at batch 300: 0.71
loss at batch 400: 0.78
Epoch 9
loss at batch 0: 0.68
loss at batch 100: 0.71
loss at batch 200: 0.62
loss at batch 300: 0.66
loss at batch 400: 0.74
#+end_example



* 评估结果
#+begin_src python :session mnist
  import numpy as np
  
  predictions = model(test_images)
  predictions = predictions.numpy()
  predicted_labels = np.argmax(predictions, axis=1)
  matches = predicted_labels == test_labels
  print(f"accuracy: {matches.mean():.2f}")
#+end_src

#+RESULTS:
: accuracy: 0.82
